package com.evsward.server.util;

/**
 * 
 */
public enum RspCodeValue {

	$1(1, "ok"), 
	$10(10,"客户端和服务端版本不一致"),
	
	$11(11, "参数异常"),
	
	$101(101, "用户异常"), 
	$102(102, "用户无效"),
	$103(103, "此员工卡已存在，请换卡"),
	$104(104, "添加选手卡异常"),
	$105(105, "该卡不是选手卡"),
	$106(106, "该卡不是员工卡"),
	
	$201(201, "查询NFC卡信息异常"), 
	$202(202, "不存在此卡"),
	$203(203, "无效NFC卡"), 
	$204(204, "查询NFC卡使用状态异常"),
	$205(205, "此卡已被注册"), 
	$206(206, "nfc会员卡添加失败"),
	
	$221(221, "模糊查询会员异常"),
	$222(222, "查询会员比赛信息异常"), 
	$223(223, "nfc刷卡查询会员异常"),
	$224(224, "查询会员比赛信息异常"), 
	$225(225, "memID查询会员异常"),
	$226(226, "会员不存在"), 
	$227(227, "编辑会员异常"), 
	$228(228, "换卡异常"),
	$229(229, "已有相同证件号"),
	$230(230, "新建会员异常"),
	$231(231, "此卡无会员信息"),
	$232(232, "保存会员图片失败"),
	$233(233, "暂未报名任何比赛"),
	$234(234, "比赛报名异常"),
	$235(235, "比赛未开始报名"),
	$236(236, "比赛已删除无法报名"),
	$237(237, "比赛已结束无法报名"),
	$238(238, "比赛已停止报名"),
	$239(239, "分桌失败"),
	$240(240, "会员正在参加该比赛，无法报名"),
	$241(241, "报名比赛失败"),
	$242(242, "座位非法"),
	
	$301(301, "设备列表查询异常"),
	$302(302, "设备不存在"),
	$303(303, "设备查询异常"),
	$304(304, "设备更新异常"),
	
	$350(350, "新建牌桌异常"),
	$351(351, "删除牌桌异常"),
	$352(352, "查询牌桌异常"),
	$353(353, "牌桌不存在"),
	$354(354, "牌桌状态不可用"),
	$355(355, "牌桌不属于该比赛"),
	$356(356, "牌桌上有选手无法释放"),
	$357(357, "牌桌被占用无法删除"),
	
	$390(390, "当天没有未结束的比赛"),
	$401(401, "新建比赛异常"),
	$402(402, "比赛名称已存在"),
	$403(403, "比赛名称排重查询异常"),
	$404(404, "查询单个比赛信息异常"),
	$405(405, "比赛不存在"),
	$406(406, "比赛已开始报名无法编辑"),
	$407(407, "编辑比赛异常"),
	$408(408, "比赛状态不允许删除"),
	$409(409, "查询比赛当前选手异常"),
	$410(410, "淘汰选手再删除比赛"),
	$411(411, "查询比赛牌桌异常"),
	$412(412, "释放牌桌再删除比赛"),
	$413(413, "删除比赛异常"),
	$414(414, "查询比赛列表异常"),
	$415(415, "暂无任何比赛"),
	$416(416, "手动暂停比赛异常"),
	$417(417, "结束比赛异常"),
	$418(418, "比赛状态不允许结束"),
	$419(419, "查询当天未结束比赛异常"),
	$420(420, "该比赛没有分配牌桌"),
	$421(421, "比赛未使用分桌系统，不可使用该功能"),
	$422(422, "比赛已删除或已结束"),
	$423(423, "比赛管理--座位查询异常"),
	$424(424, "比赛管理--进程查询异常"),
	$425(425, "比赛管理--进程,比赛未开始计时"),
	$426(426, "开启牌桌失败"),
	$427(427, "释放比赛牌桌失败"),
	$428(428, "平衡牌桌选手失败"),
	$429(429, "平衡牌桌和原牌桌一样"),
	$430(430, "指定座位已有选手"),
	$431(431, "先淘汰选手再结束比赛"),
	$432(432, "淘汰选手异常"),
	$433(433, "比赛或选手信息不存在"),
	$434(434, "比赛状态不正确"),
	$435(435, "选手状态不是已报名"),
	$436(436, "编辑扣减选手异常"),
	$437(437, "比赛管理--进程,比赛未开始或比赛已结束"),
	$438(438, "比赛管理--广告,查询异常"),
	$439(439, "比赛管理--广告,没有广告图片"),
	$440(440, "比赛管理--广告,设置广告异常"),
	$441(441, "比赛管理--玩家,查询异常"),
	$442(442, "比赛管理--筹码,查询异常"),
	$443(443, "比赛管理--筹码,没有选手"),
	$444(444, "比赛管理--筹码,选手信息不存在"),
	$445(445, "比赛管理--筹码,选手有重复记录"),
	$446(446, "比赛管理--筹码,修改用户筹码异常"),
	$447(447, "比赛管理--进程,修改时间异常"),
	$448(448, "比赛管理--进程,退一级盲注异常"),
	$449(449, "比赛管理--进程,进一级盲注异常"),
	$450(450, "查询盲注模板列表异常"),
	$451(451, "没有盲级模板"),
	$452(452, "比赛管理--奖池,查询异常"),
	$453(453, "比赛管理--奖池,查询单条奖励异常"),
	$454(454, "比赛管理--奖池,信息不存在"),
	$455(455, "比赛管理--奖池,编辑奖励异常"),
	$456(456, "比赛管理--奖池,查询奖励小条信息异常"),
	$457(457, "比赛进阶管理--比赛查询异常"),
	$458(458, "比赛进阶管理--目标比赛为开启牌桌"),
	$459(459, "比赛进阶管理--待导入比赛状态有误"),
	$460(460, "比赛进阶管理--待导入比赛不是晋级赛"),
	$461(461, "比赛进阶管理--牌桌数量不够"),
	$462(462, "比赛进阶管理--导入失败"),
	
	$463(463, "比赛管理--爆桌失败"),
	$464(464, "比赛管理--爆桌失败，比赛状态异常"),
	$465(465, "比赛管理--爆桌失败，没有存活选手"),
	$466(466, "比赛管理--爆桌失败，座位不够"),
	$467(467, "比赛管理--位移记录查询失败"),
	$468(468, "比赛进阶管理--导入失败，固定分座只能选择一个待导入比赛"),
	$469(469, "比赛带有奖励，但晋级人数超过最大奖励人数"),
	
	$470(470, "比赛管理--进程，比赛暂停中，不能修改"),
	$471(471, "比赛管理--进程，客户端和服务端不同步，调整失败"),
	$472(472, "比赛管理--进程，客户端和服务端不同步，调整失败"),
	$473(473, "比赛管理--进程，客户端和服务端不同步，调整失败"),
	$474(474, "比赛进阶管理--目标比赛没有奖励表，导入失败"),
	$475(475, "比赛进阶管理--晋级人数与钱圈人数不符，导入失败"),
	$476(476, "比赛进阶管理--目标比赛必须带有奖励表，导入失败"),
	$477(477, "比赛进阶管理--多个源比赛导入，均不能带奖励，导入失败"),
	$478(478, "比赛没有奖励信息"),
	$479(479, "大屏幕查询选手信息失败"),
	$480(480, "大屏幕查询比赛列表失败"),
	$481(481, "入场安检查询失败"),
	$482(482, "大屏幕比赛计时信息查询失败"),
	$483(483, "大屏幕注册失败"),
	$484(484, "选取的比赛没有晋级选手，导入失败"),
	$485(485, "源比赛无法多次导入"),
	$486(486, "目标比赛无法多次导入"),
	$487(487, "大屏幕显示推送异常"),
	$488(488, "没有对应的奖励区间"),
	
	
	//TCP连接方面的异常信息
	$_1(-1,"tcp连接异常");
	
	private int rspCode;
	private String msg;
	
	public int getRspCode() {
		return rspCode;
	}

	public void setRspCode(int rspCode) {
		this.rspCode = rspCode;
	}

	public String getMsg() {
		return msg;
	}

	public void setMsg(String msg) {
		this.msg = msg;
	}

	private RspCodeValue(int rspCode, String msg){
		this.rspCode = rspCode;
		this.msg = msg;
	}
}
